InformationRegisters/КартинкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КартинкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Образец</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омКартинкиНаКлиенте/Ext/Module.bsl
&НаКлиенте
Процедура ОбщееДействие(ТекущаяФорма, НажатаяКнопка, НомерКартинки) Экспорт
	
	ОбъектТЗ = ТекущаяФорма.Объект.Ссылка;
	
	Если НЕ ЗначениеЗаполнено(ОбъектТЗ) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ШифрКоманды = ПолучитьШифрКоманды(НажатаяКнопка.Имя);
	
	Если ШифрКоманды = "ДобавитьКартинку" Тогда
	
		Параметр = Новый Структура("ОбъектТЗ", ОбъектТЗ);
		ОткрытьФорму("РегистрСведений.КартинкиОбъектов.Форма.ФормаДобавитьКартинку", Параметр);	
	
	ИначеЕсли ШифрКоманды = "КартинкуВправо" Тогда
	
		ТекущаяФорма.НомерКартинки = ТекущаяФорма.НомерКартинки + 1;	
	    ВывестиКартинку(ОбъектТЗ, ТекущаяФорма.НомерКартинки, ТекущаяФорма, ТекущаяФорма.ВсегоКартинок)
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьШифрКоманды(ИмяКнопки) 
	Возврат СтрЗаменить(ИмяКнопки,"Кнопка","");
КонецФункции 

	&НаКлиенте
Асинх Процедура ВывестиКартинку(ОбъектТЗ, НомерКартинки, ТекущаяФорма, ВсегоКартинок) Экспорт

	ДанныеОФайле = омКартинкиНаСервере.ПолучитьИнформациюОКартинке(ОбъектТЗ, НомерКартинки);
	ТекущаяФорма.Картинка_авто 		= ДанныеОФайле.Картинка;
	ТекущаяФорма.ИмяКартинки_авто 	= ДанныеОФайле.Описание + " (" + (НомерКартинки + 1) + "/" + ВсегоКартинок + ")";
	
	ТекущаяФорма.Элементы.КартинкуВлево.Доступность 	= НЕ НомерКартинки = 0;	
	ТекущаяФорма.Элементы.КартинкуВправо.Доступность 	= НЕ НомерКартинки = ВсегоКартинок - 1;	
	

КонецПроцедуры // ВывестиКартинку()

&НаКлиенте
Асинх Процедура ВыбратьКартинку(Ссылка, Описание, УникальныйИдентификатор) Экспорт
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите картинку";
	ПараметрыДиалога.Фильтр = "Все файлы изображений | *.jpg; *.png; *.bmp";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога, УникальныйИдентификатор);
	Если ОписаниеФайла <> Неопределено Тогда
		
		АдресКартинки = ОписаниеФайла.Адрес;
		
		ИнформацияОФайле = Новый Структура;
		ИнформацияОФайле.Вставить("Адрес", 		АдресКартинки);
		ИнформацияОФайле.Вставить("Описание",	Описание);
		ИнформацияОФайле.Вставить("ИмяФайла",	ОписаниеФайла.СсылкаНаФайл.Имя);
		ИнформацияОФайле.Вставить("Расширение", ОписаниеФайла.СсылкаНаФайл.Расширение);
		ИнформацияОФайле.Вставить("Размер", 	ОписаниеФайла.СсылкаНаФайл.Размер());
		
		омКартинкиНаСервере.СоздатьПрисоединенныйФайл(Ссылка, ИнформацияОФайле);
		
	КонецЕсли;
	
КонецПроцедуры
